local victor = {}
-------------------------------------
victor.BY = "⚠️┋ للمزيد من الملفات : @BotLua"
-------------------------------------
victor.IsAdd = "⚠️┋المجموعه مفعله مسبقا"
victor.Add = "☑️┋تم تفعيل المجموعه بنجاح"
victor.IsUnadd = "⚠️┋المجموعه معطله مسبقا"
victor.unadd = "🚫┋تم تعطيل المجموعه"
victor.iscreator = "🔆┋بالفعل منشئ"
victor.tocreator = "🔆┋تم رفعه منشئ"
victor.isuncreator = "🔆┋بالفعل تم تنزيله من المنشئين"
victor.touncreator = "🔆┋تم تنزيله من المنشئين"
victor.issudo = "✅┋بالفعل مطور"
victor.isaddfile = "✅┋الملف مفعل مسبقا"
victor.isunaddfile = "🗂┋الملف معطل مسبقا"
victor.okaddreply = "🔊┋تم اضافه الرد بنجاح"
victor.notreply = "🔇┋لا يوجد هكذا رد"
victor.delreply = "🗑┋تم حذف الرد"
victor.listreply = "📄┋قائمه ردود الكروب : "
victor.repletstoped = "🔇┋الردود معطله مسبقا"
victor.repletstop = "🔇┋تم تعطيل الردود بنجاح"
victor.repletstart = "🔊┋تم تفعيل الردود بنجاح"
victor.repletstarted = "🔊┋الردود مفعله مسبقا"
victor.leave = "🔖┋تم مغادره المجموعه"
victor.donelift = "🔖┋تم مغادره المجموعه : "
-----------------Update-------------------------
victor.idtstop2 = "🚫┋تم تعطيل الايدي نهائيا!"
victor.isaddingall = "🚫┋لا يوجد مجموعات لفحصها"
victor.scanning = "🔄┋جاري الفحص .."
victor.scanningdel = "🔖┋تم مسح : "
victor.scanningadd = "📩┋تم تفعيل : "
victor.setchacccc = "🔄┋تم تحديث ترحيب المجموعه بنجاح"
victor.setchaccccisyes = "🔖┋الترحيب مفعل مسبقا"
victor.setchaccccyes = "📩┋تم تفعيل الترحيب"
victor.setchaccccisnoyes = "🔖┋الترحيب معطل مسبقا"
victor.setchaccccnoyes = "🚫┋تم تعطيل الترحيب"
victor.delcreatorslist = "🚫┋تم مسح قائمه المنشئين"
victor.namegr = "🔖┋اسم المجموعه : "
Tkeko.grid = "🔆┋ايدي المجموعه : "
----
victor.banarr = "🗑┋تم فحص 200 عضو وطرد الايرانين منهم"
victor.banpvc = "✔️┋تم حظر المنشورات من هاذه القناة"
victor.isstopgame = "🚫┋الالعاب معطله مسبقا"
victor.stopgame = "🚫┋تم تعطيل الالعاب"
victor.isunstopgame = "📩┋الالعاب مفعله مسبقا"
victor.unstopgame = "✅┋تم تفعيل الالعاب"
victor.username_coins = "\n💰┋ نقاطك • "
victor.isnotcois = "🚫┋نقاطك صفر لايمكنك بيعها"
victor.Donecoins = "✅┋تم بيع : "
victor.Done2coins = " نقطه\n📩┋واضافه رسائل : "
victor.Goosgame = "🎉┋مبروك فزت"
victor.sppedgame = "📩┋اسرع واحد يكتب : "
------------------------------------------------
victor.donenewgr2 = "🚫┋تم اضافتي الى مجموعه جديده"
victor.candeld2 = "🔇┋يمكنك حذف البيانات امتعلقه بالمجموعه ومغادرتها عن طريق الرد على هاذه الرساله بكلمه : `نعم`"
------------------------------------------------
victor.candeld = "🔇┋يمكنك حذف البيانات امتعلقه بالمجموعه عن طريق الرد على هاذه الرساله بكلمه : `نعم`"
victor.donelift2 = "🔖┋تم طردي من المجموعه "
victor.donedeldata = "🚫┋تم مسح جميع البيانات"
------------------------------
victor.help =
    [[
📌┇هناكـ {5} اوامر لعرضها
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
🔐┇م1  ← آوآمر آلحمايه 

📍┇م2 ← آوآمر آلآدمنيه

📝┇م3 ← آوآمر آلمنشئ

⚒┇م4 ← آوآمر المطور 

🔧┇م5 ← اوامر المطور الاساسي
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
]]

victor.h1 =
    [[
📮┇ اوامر حمايه المجموعه
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
👥┇قفل/فتح + الاوامر الادناه ( للقفل على جميع الاعضاء )

👤┇قفل/فتح + الاوامر الادناه + [ رد او معرف او ايدي ] ( للقفل على شخص معين )
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
🔖┇الروابط
🔖┇المعرفات
🔖┇التثبيت
🔖┇المتحركه
🔖┇الاستفتاء
🔖┇الملفات
🔖┇الصور
🔖┇الملصقات
🔖┇الفيديو
🔖┇ الانلاين
🔖┇الدردشه
🔖┇التوجيه
🔖┇الاغاني
🔖┇الجهات
🔖┇الاشعارات
🔖┇الماركدون
🔖┇البوتات
🔖┇التكرار
🔖┇الكلايش
🔖┇الكل
🔖┇الدخول

┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
]]

victor.h2 =
    [[
📮┇ اوامر الادمنيه 
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
🚫┇كتم [ رد , معرف ، ايدي ]
🚫┇حظر [ رد , معرف ، ايدي ]
🚫┇تقييد [ رد , معرف ، ايدي ]

⛔️┇الغاء كتم [ رد , معرف ، ايدي ]
⛔️┇الغاء حظر [ رد , معرف ، ايدي ]
⛔️┇الغاء تقييد [ رد , معرف ، ايدي ]

📖┇المكتومين  
📖┇المحظورين 
📖┇المقيديين 
📖┇الردود 

🗑┇مسح المكتومين  
🗑┇مسح المحظورين 
🗑┇مسح المقيديين
🗑┇مسح الدردود 
🗑┇مسح البوتات 
🗑┇مسح الايرانين
🗑┇مسح الوهميين

📜┇اضف رد الكلمه [ رد على النص او الميديا ]
🗑┇حذف رد الكلمه 


📃┇الاعدادات 
🗒┇الاعدادات بالرد او معرف او ايدي

🔏┇منع كلمه / الغاء منع الكلمه 

⚙️┇تعطيل / تفعيل الردود 
⚙️┇تعطيل / تفعيل الايدي
⚙️┇تعطيل / تفعيل التقيد 

🔗┇وضع رابط 
📝┇تعين عدد التكرار العدد
📝┇تعين عدد الكليشه العدد
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
]]

victor.h3 =
    [[ 
🔘┇وضع :- مع الاوامر ادناه
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
🌄┇وضع صوره بالرد عل صوره 

⌨️┇وضع وصف الوصف 
📚┇وضع اسم الاسم 

🗑┇تنظيف العدد

♦️┇رفع ادمن / تنزيل ادمن ( رد , ايدي , معرف )
♦️┇رفع ادمن بالكروب / تنزيل ادمن بالكروب ( رد , ايدي , معرف )

🗒┇الادمنيه
🗑┇مسح الادمنيه 

📝┇وضع ترحيب الترحيب (#id , #username , #name)
🎤┇تفعيل / تعطيل الترحيب
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
]]

victor.h4 =
    [[
🔘┇اوامر المطور 
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
🔍┇تفعيل / تعطيل
⛓┇مغادره 
♦️┇رفع منشئ / تنزيل منشئ
📖┇المنشئين 
🗑┇مسح المنشئين 

📕┇اضف رد عام الكلمه ( بالرد عل نص او ميديا )
🗑┇مسح رد عام الكلمه 
📝┇ردود العام 
🗑┇مسح ردود العام
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
]]

victor.h5 =
    [[
🔘┇اوامر المطور الاساسي
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
⚙️┇رست او تحديث 

♦️┇تفعيل / تعطيل التواصل 
♦️┇تفعيل / تعطيل الوضع الخدمي 
♦️┇تفعيل / تعطيل الاشتراك

📂┇رفع ملف ( بالرد على الملف )
📂┇تفعيل ملف اسم الملف 
📂┇تعطيل ملف اسم الملف
📂┇مسح ملف اسم الملف 
📂┇جلب ملف اسم الملف 
📂┇ملفات اللغات 
📂┇ملفات الاضافيه 

📎┇تعين start الراسله 
📝┇تعين كليشه المطور الكليشه 

🖇┇روابط الكروبات 
📈┇عدد الكروبات او عدد الخاص 


🎤┇اذاعه بالرد على المنشور  ( للكل )
🎤┇اذاعه خاص بالرد على المنشور ( للمشتركين )
🎤┇اذاعه للكروبات بالرد على المنشور ( للكروبات )

🎤┇اذاعه بالتثبيت بالرد على المنشور ( اذاعه + تثبيت للمنشور بالكروب )
🎤┇اذاعه توجيه بالرد على المنشور 

🎤┇فحص الكل

⛓┇رفع مطور / تنزيل مطور ( رد , ايدي , معرف )
📜┇المطورين 
🗑┇مسح المطورين 

🚫┇حظر / الغاء حظر ( بالرد ) تواصل
🚫┇حظر عام / الغاء حظر عام ( رد , ايدي , معرف )
📜┇المحظورين عام 
🗑┇مسح المحظورين عام
┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉
]]

------------------------------
victor.show = "👤┋اضغط هنا لمشاهده الحساب"
victor.toadminusers = "✔️┋تم رفع : "
victor.notbotsgr = "🚫┋لا يوجد بوتات لطردها"
victor.botsban = "✔️┋تم طرد : "
victor.idtstoped = "🚫┋الايدي معطل مسبقا"
victor.idtstop = "🚫┋تم تعطيل الايدي بنجاح"
victor.idstart = "✔️┋تم تفعيل الايدي بنجاح"
victor.idtstarted = "✔️┋الايدي مفعل مسبقا"
victor.isseudoserver = "مطور اساسي \n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.issudoonredis = "مطور\n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.iscruter_i = "منشئ\n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.isadmin_i = "ادمن\n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.isvip_i = "عضو مميز\n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.usergr = "عضو فقط\n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.timej = "\n🔄┋ تاريخ انضمامك • "
victor.jonenot = "غير معروف"
victor.liftu = "مغادر\n ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉ ┉"
victor.photos_msg = "\n🏞┋ عدد الصور •  "
victor.id_msg = "\n🎟┋ ايديــك •  "
victor.username_msg = "\n🎭┋ مـعرفك • "
victor.notusername_msg = "ليس لديه معرف"
victor.stsus_msg = "\n📌┋ موقعـك • "
victor.msgs_msg = "\n💌┋ رسائلك • "
victor.msgs_msg2 = "💌┋ رسائلك • : "
victor.id_msg_channle = "\n🆔┋ايدي القناة"
victor.id_msg_channle2 = "📢┋القناة : "
victor.send_new_username = "📩┋ارسال الان معرف قناتك "
victor.channleis = "🚫┋الاشتراك معطل مسبقا"
victor.channleok = "🚫┋تم تعطيل الاشتراك"
victor.tesxtcchannle = "🔊┋شترك هنا : "
victor.users = "⚪️┋عدد المستخدمين : "
victor.addnote = "✔️┋تم تفعيل المجموعه : "
victor.unaddnote = "✖️┋تم تعطيل المجموعه : "
victor.addnoteby = "👤┋بواسطه : "
victor.creatorslist = "📄┋قائمه المنشئين :"
victor.notcreators = "🗒┋لا يوجد منشئين"
victor.isauto = "✔️┋الوضع الخدمي مفعل مسبقا"
victor.auto = "✔️┋تم تفعيل الوضع الخدمي"
victor.isunauto = "✖️┋الوضع الخدمي مفعل مسبقا"
victor.unauto = "✖️┋تم تعطيل الوضع الخدمي"
victor.okSetSter = "✉️┋تم تعين رساله : "
victor.okSetnamebot = "✔️┋تم تعين اسم بوت : "
victor.notban_all = "🚫┋لا يوجد قائمه محظورين عام"
victor.ban_alllist = "✏️┋قائمه المحظرين عام : "
victor.del_list_ban_all = "🗑┋تم حذف قائمه المحظورين عام"
victor.botNotAdmin = "📢┋البوت ليس ادمن في القناة"
victor.botAdmin = "📢┋تم تفعيل الاشتراك الاجباري"
victor.isban_all = "🚫┋محظور عام مسبقا"
victor.toban_all = "🚫┋تم حظره من المجموعات البوت"
victor.isunban_all = "📄┋غير محظور مسبقا"
victor.tounban_all = "✔️┋ تم الغاء حظره عام"
------------------------------
victor.listreplyall = "📄┋قائمه ردود العامه : "
victor.notlistreplyall = "❗️┋لا يوجد ردود في البوت"
victor.dellistreplyall = "🗑┋تم مسح قائمه ردود العامه"
victor.notlistreply = "❗️┋لا يوجد ردود في المجموعه"
victor.dellistreply = "🗑┋تم مسح قائمه ردود الكروب"
victor.filenot = "‼️┋الملف لا يدعم سورس كيكو"
victor.addfileonf = "☑️┋تم تفعيل الملف الاضافي بنجاح"
victor.addfilelang = "☑️┋تم تفعيل ملف الغه بنجاح"
victor.unaddfileonf = "☑️┋تم تعطيل الملف الاضافي بنجاح"
victor.unaddfilelang = "☑️┋تم تعطيل ملف الغه بنجاح"
victor.banpv = "✔️┋تم حظر المستخدم من التواصل"
victor.okDellang = "🗑┋تم حذف ملف من مجلد { langs }"
victor.notokDellang = "⁉️┋لا يوجد هكذا ملف في مجلد { langs }"
victor.okDelfile = "🗑┋تم حذف ملف من مجلد { files }"
victor.notokDelfile = "⁉️┋لا يوجد هكذا ملف في مجلد { files }"
victor.unbanpv = "❗️┋تم الغاء حظر المستخدم من التواصل"
victor.bantext = "☑️┋تم منع كلمه : "
victor.isbantext = "⁉️┋الكلمه ممنوعه مسبقا"
victor.okdelbantext = "🗑┋تم مسح قائمه الكلمات الممنوعه"
victor.nobantext = "❕┋لا يوجد كلمات ممنوعه"
victor.listbanetext = "📄┋قائمه الكلمات الممنوعه : "
victor.unbantext = "✔️┋تم الغاء منع كلمه : "
victor.isunbantext = "❗️┋تم الغاء منع الكلمه مسبقا"
victor.isstoppv = "🚫┋التواصل معطل مسبقا"
victor.stoppv = "🚫┋تم تعطيل التواصل"
victor.isunstoppv = "📩┋التواصل مفعل مسبقا"
victor.unstoppv = "✔️┋تم تفعيل التواصل"
victor.lagfile = "🗂┋تم رفع ملف الغه الى مجلد { langs }"
victor.luafile = "🗂┋تم رفع الملف الاضافي الى مجلد { files }"
victor.listfilelng = "📄┋قائمه ملفات اللغات : "
victor.listfilelngad = "✔️مفعل"
victor.notfile = "🚫┋لا يوجد ملفات"
victor.listfilmore = "🗂┋قائمه الملفات الاضافيه : "
victor.listfilmoread = "✔️مفعل"
victor.witupdate = "🗂┋جاري رفع الملف"
victor.tosudo = "✔️┋تم رفعه مطور"
victor.isunsudo = "🔻┋بالفعل تم تنزيله من المطورين"
victor.tounsudo = "🔻┋تم تنزيله من المطورين"
victor.isadmin = "☑️┋بالفعل ادمن"
victor.toadmin = "☑️┋تم رفعه ادمن"
victor.isunadmin = "☑️┋بالفعل تم تنزيله من الادمنيه"
victor.tounadmin = "☑️┋تم تنزيله من الادمنيه"
victor.deletevip = "🗑┋تم حذف قائمه الاعضاء المميزين"
victor.isdeletevip = "📈┋لا يوجد اعضاء مميزين"
victor.viplist = "📃┋قائمه الاعضاء المميزين : "
victor.isvip = "☑️┋بالفعل عضو مميز"
victor.tovip = "☑️┋تم رفعه عضو مميز"
victor.isunvip = "☑️┋بالفعل تم تنزيله من الاعضاء المميزين"
victor.tounvip = "☑️┋تم تنزيله من الاعضاء المميزين"
victor.notsudo = "📜┋لا يوجد مطورين"
victor.linkGR = "📮┋رابط المجموعه : "
victor.mut_grlist = "📄┋قائمه المقيديين : "
victor.dellistmut_gr = "🗑┋تم حذف قائمه المقيديين"
victor.notmut_grlist = "📜┋لا يوجد مقيديين"
victor.linkGRerre = "◻️┋ارسل وضع رابط"
victor.sendlink = "📩┋ارسال الرابط الان"
victor.pv_stop = "❕┋تم تعطيل التواصل مع المطور"
victor.pv_start = "🌐┋مرحبا بك في بوت حمايه \n\n📨┋ارسال ماتريد وسارسله الى المطور"
victor.pv_send = "📩┋تم ارسال رسالتك الى المطور"
victor.savelink = "📌┋تم حفظ الرابط"
victor.sudolist = "📄┋قائمه المطورين : "
victor.del_list_sudo = "🗑┋تم حذف قائمه المطورين"
victor.isban = "☑️┋محظور بالفعل"
victor.ban = "☑️┋تم حظره من المجموعه"
victor.unban = "☑️┋تم الغاء حظره من المجموعه"
victor.isunban = "🚫┋غير محظور مسبقا"
victor.dellistban = "🗑┋تم حذف قائمه المحظورين"
victor.deleteadmin = "🗑┋تم حذف قائمه الادمنيه"
victor.isdeleteadmin = "📈┋لا يوجد ادمنيه"
victor.banlist = "📛┋قائمه المحظورين : "
victor.notban = "🚫┋لا يوجد محظورين"
victor.dc = "📢┋تم عمل اذاعه للمنشور بشكل مباشر"
victor.dcfwd = "📢┋تم عمل اذاعه للمنشور بشكل توجيه"
victor.clean = "🗑┋تم تنظيف : "
victor.notclean = "لا يمكنك تنظيف اكثر من 1000🚫┋رساله"
victor.setphoto = "🔄┋تم تحديث صوره المجموعه بنجاح"
victor.setchattitle = "🔄┋تم تحديث اسم المجموعه بنجاح"
victor.changeDescription = "🔄┋تم تحديث وصف المجموعه بنجاح"
victor.all_add_gr = "📻┋عدد الكروبات المفعله : "
victor.all_gr = "📻┋عدد الكروبات الكلي : "
victor.all_gr_not_add = "🚫┋عدد الكروبات الغير مفعله : "
victor.ismute_ge = "☑️┋مقيد بالفعل"
victor.mute_ge = "☑️┋تم تقييده من المجموعه"
victor.unmute_ge = "☑️┋تم الغاء تقييده من المجموعه"
victor.isunmute_ge = "🚫┋غير مقيد مسبقا"
victor.dellistmute_ge = "🗑┋تم حذف قائمه المقيدين"
victor.mute_gelist = "📄┋قائمه المقيدين : "
victor.notmute_ge = "❕┋لا يوجد مقيدين"
victor.ismute = "🔇┋مكتوم بالفعل"
victor.mute = "🔇┋تم كتمه من البوت"
victor.isunmute = "☑️┋غير مكتوم مسبقا"
victor.unmute = "☑️┋تم الغاء كتمه في البوت"
victor.isamdinno = "🚫┋لا يمكنك عمل ذلك في المدراء"
victor.setmaxspam = "🔃┋تم تعيين عدد التكرار : "
victor.setmaxlist = "📑┋تم تعيين عدد احرف الكلايش : "
victor.user = "👤┋المستخدم ← "
victor.erroru = "⚠️┋حدث خطأ"
victor.notmute = "🚫┋لا يوجد مكتومين"
victor.mutelist = "📃┋قائمه المكتومين : "
victor.adminlist = "📃┋قائمه الادمنيه : "
victor.unpinmsg = "📮┋تم الغاء التثبيت"
victor.pinmsg = "📮┋تم تثبيت الرساله"
victor.dellistmute = "🗑┋تم حذف قائمه المكتومين"
victor.user_send = "👤┋بواسطه : "
victor.muteongr = "☑️┋تم تفعيل التقييد"
victor.ismuteongr = "☑️┋التقييد مفعل مسبقا"
victor.isunmuteongr = "☑️┋التقييد معطل مسبقا"
victor.unmuteongr = "☑️┋تم تعطيل التقييد"
victor.youlock = "عليه"

victor.settings = {
    text = "🔧┋اعدادات المجموعه : ",
    text2 = "🔧┋اعدادات الشخص في المجموعه : ",
    open = " مفتوح ✔️ \n",
    lock = " مقفول ✖️ \n",
    fwd = "التوجيه┇",
    link = "الروابط┇",
    chat = "الدردشه┇",
    username = "المعرفات┇",
    list = "الكلايش┇",
    file = "الملفات┇",
    sticker = "الملصقات┇",
    music = "الصوتيات┇",
    markdown = "الماركدون┇",
    inlines = "الانلاين┇",
    photo = "الصور┇",
    bots = "اضافه البوتات┇",
    gif = "المتحركه┇",
    note = "الاشعارات┇",
    join = "الدخول للمجموعه┇",
    spam = "التكرار┇",
    all = "الكل┇",
    pin = "التثبيت┇",
    contact = "الجهات┇",
    poll = "الاستفتاء┇",
    edit_media = "تعديل الميديا┇",
    spamc = "📃┋عدد التكرار : ",
    listc = "📃┋عدد احرف الكليشه : "
}

victor.lock = {
    -----------------Update-------------------------
    poll = "☑️┋تم قفل الاستفتاء",
    ispoll = "☑️┋الاستفتاء مقفول مسبقا",
    open_poll = "☑️┋تم فتح الاستفتاء",
    isopen_poll = "☑️┋الاستفتاء مفتوح مسبقا",
    ------------------------------------------------
    link = "☑️┋تم قفل الروابط",
    islink = "☑️┋الروابط مقفوله مسبقا",
    open_link = "☑️┋تم فتح الروابط",
    isopen_link = "☑️┋الروابط مفتوحه مسبقا",
    ----------
    contact = "☑️┋تم قفل الجهات",
    iscontact = "الجهات مقفوله مسبقا",
    open_contact = "☑️┋تم فتح الجهات",
    isopen_contact = "الجهات مفتوحه مسبقا",
    ----------
    pin = "🖇┋تم قفل التثبيت",
    ispin = "🖇┋التثبيت مقفول مسبقا",
    open_pin = "🖇┋تم فتح التثبيت",
    isopen_pin = "🖇┋التثبيت مفتوح مسبقا",
    ----------
    join = "☑️┋تم قفل الانضمام للمجموعه",
    isjoin = "☑️┋الانضمام للمجموعه مقفول مسبقا",
    open_join = "☑️┋تم فتح الانضمام للمجموعه",
    isopen_join = "☑️┋الانضمام للمجموعه مفتوح مسبقا",
    ----------
    edit_media = "📺┋تم قفل تعديل الميديا",
    isedit_media = "📺┋تعديل الميديا مقفول مسبقا",
    open_edit_media = "📺┋تم فتح تعديل الميديا",
    isopen_edit_media = "📺┋تعديل الميديا مفتوح مسبقا",
    ----------
    fwd = "↪️┋تم قفل التوجيه",
    isfwd = "↪️┋التوجيه مقفول مسبقا",
    open_fwd = "↪️┋تم فتح التوجيه",
    isopen_fwd = "↪️┋التوجيه مفتوح مسبقا",
    ----------
    photo = "📸┋تم قفل الصور",
    isphoto = "📸┋الصور مقفوله مسبقا",
    open_photo = "📸┋تم فتح الصور",
    isopen_photo = "📸┋الصور مفتوحه مسبقا",
    ----------
    video = "🎞┋تم قفل الفديو",
    isvideo = "🎞┋الفديوهات مقفوله مسبقا",
    open_video = "🎞┋تم فتح الفديو",
    isopen_video = "🎞┋الفديوهات مفتوحه مسبقا",
    ----------
    gif = "📽┋تم قفل المتحركه",
    isgif = "📽┋المتحركه مقفوله مسبقا",
    open_gif = "📽┋تم فتح المتحركه",
    isopen_gif = "📽┋المتحركه مفتوحه مسبقا",
    ----------
    username = "🔘┋تم قفل المعرفات",
    isusername = "🔘┋المعرفات مقفوله مسبقا",
    open_username = "🔘┋تم فتح المعرفات",
    isopen_username = "🔘┋المعرفات مفتوحه مسبقا",
    ----------
    inline = "📤┋تم قفل الانلاين",
    isinline = "📤┋الانلاين مقفول مسبقا",
    open_inline = "📤┋تم فتح الانلاين",
    isopen_inline = "📤┋الانلاين مفتوح مسبقا",
    ----------
    markdown = "📛┋تم قفل الماركدون",
    ismarkdown = "📛┋الماركدون مقفول مسبقا",
    open_markdown = "📛┋تم فتح الماركدون",
    isopen_markdown = "📛┋الماركدون مفتوح مسبقا",
    ----------
    note = "‼️┋تم قفل الاشعارات",
    isnote = "‼️┋الاشعارات مقفول مسبقا",
    open_note = "‼️┋تم فتح الاشعارات",
    isopen_note = "‼️┋الاشعارات مفتوح مسبقا",
    ----------
    bots = "🤖┋تم قفل البوتات",
    isbots = "🤖┋البوتات مقفوله مسبقا",
    open_bots = "🤖┋تم فتح البوتات",
    isopen_bots = "🤖┋البوتات مفتوحه مسبقا",
    ----------
    chat = "🌐┋تم قفل الدردشه",
    ischat = "🌐┋الدردشه مقفوله مسبقا",
    open_chat = "🌐┋تم فتح الدردشه",
    isopen_chat = "🌐┋الدردشه مفتوحه مسبقا",
    ----------
    spam = "🔃┋تم قفل التكرار",
    isspam = "🔃┋التكرار مقفول مسبقا",
    open_spam = "🔃┋تم فتح التكرار",
    isopen_spam = "🔃┋التكرار مفتوح مسبقا",
    ----------
    sticker = "🔖┋تم قفل الملصقات",
    issticker = "🔖┋الملصقات مقفوله مسبقا",
    open_sticker = "🔖┋تم فتح الملصقات",
    isopen_sticker = "🔖┋الملصقات مفتوحه مسبقا",
    ----------
    file = "🗂┋تم قفل الملفات",
    isfile = "🗂┋الملفات مقفوله مسبقا",
    open_file = "🗂┋تم فتح الملفات",
    isopen_file = "🗂┋الملفات مفتوحه مسبقا",
    ----------
    music = "🎧┋تم قفل الصوتيات",
    ismusic = "🎧┋الصوتيات مقفوله مسبقا",
    open_music = "🎧┋تم فتح الصوتيات",
    isopen_music = "🎧┋الصوتيات مفتوحه مسبقا",
    ----------
    list = "📑┋تم قفل الكلايش",
    islist = "📑┋الكلايش مقفوله مسبقا",
    open_list = "📑┋تم فتح الكلايش",
    isopen_list = "📑┋الكلايش مفتوحه مسبقا",
    ----------
    all = "🎚┋تم قفل الكل",
    isall = "🎚┋الكل مقفول مسبقا",
    open_all = "🎚┋تم فتح الكل",
    isopen_all = "🎚┋الكل مفتوح مسبقا"
}
-------------------------------------
y = {}
---------------------
--[[
y["شونك"] = {
    "تمام",
    "زين",
    "مو زين",
}

y["بوت"] = {
    "نعم حبي",
    "كول ضلعي",
    "ها حمبي",
}
]]
--------------------
victor.reply = y
-------------------------------------
return victor
